FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_sensor/motor_sensor_esp32.c
/*
 * Copyright (c) 2026 Zephyr Motor Control Contributors
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Espressif ESP32 family: SAR ADC digital + DMA EOF (GDMA or I2S/SPI-linked on legacy SoCs).
 * ADC digital path is implemented here (same idea as Zephyr adc_esp32_dma.c) so this
 * driver stays self-contained; only Espressif HAL/LL headers are used.
 */

#define DT_DRV_COMPAT zephyr_motor_sensor_esp32

#include <errno.h>
#include <math.h>
#include <stdint.h>
#include <string.h>

#include <esp_clk_tree.h>
#include <esp_err.h>
#include <esp_intr_alloc.h>
#include <esp_private/adc_share_hw_ctrl.h>
#include <esp_private/sar_periph_ctrl.h>
#include <hal/adc_hal.h>
#include <hal/adc_ll.h>
#include <hal/adc_types.h>
#include <hal/mcpwm_ll.h>
#include <soc/soc.h>
#include <soc/soc_caps.h>

#if !defined(SOC_ADC_DIG_CTRL_SUPPORTED) || (SOC_ADC_DIG_CTRL_SUPPORTED != 1)
#error "motor_sensor_esp32: SoC must provide SAR ADC digital controller (SOC_ADC_DIG_CTRL_SUPPORTED)"
#endif

#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>
#if SOC_GDMA_SUPPORTED
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_esp32.h>
#include <hal/adc_ll.h>
#elif defined(CONFIG_SOC_SERIES_ESP32)
#include <esp_private/periph_ctrl.h>
#include <hal/i2s_ll.h>
#define MOTOR_ADC_DMA_I2S_HOST 0
#define MOTOR_ADC_DMA_INTR_MASK I2S_LL_EVENT_RX_EOF
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
#include <esp_private/periph_ctrl.h>
#include <hal/spi_ll.h>
#include <hal/spi_types.h>
#define MOTOR_ADC_DMA_SPI_HOST SPI3_HOST
#define MOTOR_ADC_DMA_INTR_MASK SPI_LL_INTR_IN_SUC_EOF
#endif
#include <zephyr/drivers/motor/motor_actuator.h>
#include <zephyr/drivers/motor/motor_sensor.h>
#include <zephyr/kernel.h>
#if IS_ENABLED(CONFIG_SENSOR)
#include <zephyr/drivers/sensor.h>
#endif
#include <zephyr/sys/util.h>

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

#define AMPS_PER_VOLT_DEFAULT 1.0f

#define UNIT_ATTEN_UNINIT UINT32_MAX

typedef void (*motor_enc_adc_eof_fn)(void *user, const uint8_t *dma_buf, uint32_t n_bytes);

struct motor_enc_adc_digi_ctx {
	adc_unit_t unit;
	const struct device *dma_dev;
	uint8_t dma_channel;
	const struct device *clock_dev;
	clock_control_subsys_t clock_subsys;
	adc_hal_dma_ctx_t adc_hal_dma_ctx;
	dma_descriptor_t *rx_desc;
	uint8_t *dma_buffer;
	uint32_t dma_buffer_bytes;
	uint32_t block_samples;
#if SOC_GDMA_SUPPORTED
	struct dma_config dma_cfg;
	struct dma_block_config dma_blk;
#endif
	bool running;
	bool digi_started;
	motor_enc_adc_eof_fn eof_fn;
	void *eof_user;
#if !SOC_GDMA_SUPPORTED
	intr_handle_t irq_handle;
#endif
};

#if SOC_ADC_CALIBRATION_V1_SUPPORTED
static void motor_enc_adc_hw_calibration(adc_unit_t unit)
{
	adc_hal_calibration_init(unit);
	for (int j = 0; j < SOC_ADC_ATTEN_NUM; j++) {
		adc_calc_hw_calibration_code(unit, j);
#if SOC_ADC_CALIB_CHAN_COMPENS_SUPPORTED
		for (int k = 0; k < SOC_ADC_CHANNEL_NUM(unit); k++) {
			adc_load_hw_calibration_chan_compens(unit, k, j);
		}
#endif
	}
}
#else
static void motor_enc_adc_hw_calibration(adc_unit_t unit)
{
	ARG_UNUSED(unit);
}
#endif

#if SOC_GDMA_SUPPORTED

static int motor_enc_adc_dma_run(struct motor_enc_adc_digi_ctx *ctx)
{
	int err;

	err = dma_config(ctx->dma_dev, ctx->dma_channel, &ctx->dma_cfg);
	if (err != 0) {
		return err;
	}

	return dma_start(ctx->dma_dev, ctx->dma_channel);
}

static void IRAM_ATTR motor_enc_adc_dma_eof_cb(const struct device *dma_dev, void *user_data,
					       uint32_t channel, int status)
{
	struct motor_enc_adc_digi_ctx *ctx = user_data;
	int err;

	ARG_UNUSED(dma_dev);
	ARG_UNUSED(channel);

	if (ctx->eof_fn == NULL) {
		return;
	}

	if (status != DMA_STATUS_COMPLETE) {
		return;
	}

	ctx->eof_fn(ctx->eof_user, ctx->dma_buffer, ctx->dma_buffer_bytes);

	err = dma_stop(ctx->dma_dev, ctx->dma_channel);
	if (err != 0) {
		return;
	}

	(void)motor_enc_adc_dma_run(ctx);
}

#else

static void motor_enc_adc_legacy_digi_arm(struct motor_enc_adc_digi_ctx *ctx)
{
#if defined(CONFIG_SOC_SERIES_ESP32)
	i2s_dev_t *i2s_dev = I2S_LL_GET_HW(MOTOR_ADC_DMA_I2S_HOST);

	i2s_ll_rx_stop_link(i2s_dev);
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_dev_t *spi_dev = SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST);

	spi_ll_disable_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_ll_clear_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_dma_ll_rx_stop(spi_dev, 0);
#endif

	adc_hal_digi_connect(false);

#if defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_dma_ll_rx_reset(SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST), 0);
#endif

	adc_hal_digi_reset();
	adc_hal_digi_dma_link(&ctx->adc_hal_dma_ctx, ctx->dma_buffer);

#if defined(CONFIG_SOC_SERIES_ESP32)
	{
		i2s_dev_t *i2s_dev = I2S_LL_GET_HW(MOTOR_ADC_DMA_I2S_HOST);

		i2s_ll_clear_intr_status(i2s_dev, MOTOR_ADC_DMA_INTR_MASK);
		i2s_ll_enable_intr(i2s_dev, MOTOR_ADC_DMA_INTR_MASK, true);
		i2s_ll_enable_dma(i2s_dev, true);
		i2s_ll_rx_start_link(i2s_dev, (uint32_t)ctx->adc_hal_dma_ctx.rx_desc);
	}
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	{
		spi_dev_t *spi_dev = SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST);

		spi_ll_clear_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
		spi_ll_enable_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
		spi_dma_ll_rx_start(spi_dev, 0, (lldesc_t *)ctx->adc_hal_dma_ctx.rx_desc);
	}
#endif

	adc_hal_digi_connect(true);
	adc_hal_digi_enable(true);
}

static void IRAM_ATTR motor_enc_adc_legacy_dma_isr(void *arg)
{
	struct motor_enc_adc_digi_ctx *ctx = arg;

#if defined(CONFIG_SOC_SERIES_ESP32)
	i2s_dev_t *i2s_dev = I2S_LL_GET_HW(MOTOR_ADC_DMA_I2S_HOST);

	if ((i2s_ll_get_intr_status(i2s_dev) & MOTOR_ADC_DMA_INTR_MASK) == 0U) {
		return;
	}

	i2s_ll_clear_intr_status(i2s_dev, MOTOR_ADC_DMA_INTR_MASK);
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_dev_t *spi_dev = SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST);

	if ((spi_ll_get_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK)) == 0U) {
		return;
	}

	spi_ll_clear_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
#else
	return;
#endif

	if (ctx->eof_fn != NULL) {
		ctx->eof_fn(ctx->eof_user, ctx->dma_buffer, ctx->dma_buffer_bytes);
	}

	motor_enc_adc_legacy_digi_arm(ctx);
}

