FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_sensor/motor_sensor_esp32.c
#endif /* SOC_GDMA_SUPPORTED */

static int motor_enc_adc_digi_hw_start(struct motor_enc_adc_digi_ctx *ctx,
				       adc_hal_digi_ctrlr_cfg_t *dig_cfg, uint32_t unit_atten,
				       uint32_t n_samples)
{
	__maybe_unused int err = 0;

	sar_periph_ctrl_adc_continuous_power_acquire();
	adc_lock_acquire(ctx->unit);

#if SOC_ADC_CALIBRATION_V1_SUPPORTED
	adc_set_hw_calibration_code(ctx->unit, unit_atten);
#endif

#if SOC_ADC_ARBITER_SUPPORTED
	if (ctx->unit == ADC_UNIT_2) {
		adc_arbiter_t arb = ADC_ARBITER_CONFIG_DEFAULT();

		adc_hal_arbiter_config(&arb);
	}
#endif

	adc_hal_dma_config_t hal_dma_cfg = {
		.eof_desc_num = 1,
		.eof_step = 1,
		.eof_num = n_samples,
	};

	adc_hal_dma_ctx_config(&ctx->adc_hal_dma_ctx, &hal_dma_cfg);
	adc_hal_set_controller(ctx->unit, ADC_HAL_CONTINUOUS_READ_MODE);
	adc_hal_digi_init(&ctx->adc_hal_dma_ctx);
	adc_hal_digi_controller_config(&ctx->adc_hal_dma_ctx, dig_cfg);

	adc_hal_digi_enable(false);

#if defined(CONFIG_SOC_SERIES_ESP32)
	i2s_dev_t *i2s_dev = I2S_LL_GET_HW(MOTOR_ADC_DMA_I2S_HOST);

	i2s_ll_rx_stop_link(i2s_dev);
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_dev_t *spi_dev = SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST);

	spi_ll_disable_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_ll_clear_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_dma_ll_rx_stop(spi_dev, 0);
#endif

	adc_hal_digi_connect(false);

#if defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_dma_ll_rx_reset(spi_dev, 0);
#endif

	adc_hal_digi_reset();

#if SOC_GDMA_SUPPORTED
	err = motor_enc_adc_dma_run(ctx);
	if (err != 0) {
		adc_lock_release(ctx->unit);
		sar_periph_ctrl_adc_continuous_power_release();
		return err;
	}
#else
	adc_hal_digi_dma_link(&ctx->adc_hal_dma_ctx, ctx->dma_buffer);

#if defined(CONFIG_SOC_SERIES_ESP32)
	i2s_ll_clear_intr_status(i2s_dev, MOTOR_ADC_DMA_INTR_MASK);
	i2s_ll_enable_intr(i2s_dev, MOTOR_ADC_DMA_INTR_MASK, true);
	i2s_ll_enable_dma(i2s_dev, true);
	i2s_ll_rx_start_link(i2s_dev, (uint32_t)ctx->adc_hal_dma_ctx.rx_desc);
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_ll_clear_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_ll_enable_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_dma_ll_rx_start(spi_dev, 0, (lldesc_t *)ctx->adc_hal_dma_ctx.rx_desc);
#endif
#endif

	adc_hal_digi_connect(true);
	adc_hal_digi_enable(true);

	ctx->digi_started = true;
	return 0;
}

static void motor_enc_adc_digi_hw_halt(struct motor_enc_adc_digi_ctx *ctx)
{
	if (!ctx->digi_started) {
		return;
	}

#if defined(CONFIG_SOC_SERIES_ESP32)
	i2s_dev_t *i2s_dev = I2S_LL_GET_HW(MOTOR_ADC_DMA_I2S_HOST);

	i2s_ll_enable_intr(i2s_dev, MOTOR_ADC_DMA_INTR_MASK, false);
	i2s_ll_clear_intr_status(i2s_dev, MOTOR_ADC_DMA_INTR_MASK);
	i2s_ll_rx_stop_link(i2s_dev);
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	spi_dev_t *spi_dev = SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST);

	spi_ll_disable_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_ll_clear_intr(spi_dev, MOTOR_ADC_DMA_INTR_MASK);
	spi_dma_ll_rx_stop(spi_dev, 0);
#endif

#if !SOC_GDMA_SUPPORTED
	if (ctx->irq_handle != NULL) {
		(void)esp_intr_disable(ctx->irq_handle);
	}
#endif

	adc_hal_digi_enable(false);
	adc_hal_digi_connect(false);

#if defined(ADC_LL_WORKAROUND_CLEAR_EOF_COUNTER) && ADC_LL_WORKAROUND_CLEAR_EOF_COUNTER
	adc_hal_digi_clr_eof();
#endif

	adc_hal_digi_deinit();
	adc_lock_release(ctx->unit);
	sar_periph_ctrl_adc_continuous_power_release();

#if SOC_GDMA_SUPPORTED
	(void)dma_stop(ctx->dma_dev, ctx->dma_channel);
#endif

	ctx->digi_started = false;
}

static int motor_enc_adc_digi_init(struct motor_enc_adc_digi_ctx *ctx)
{
	int err;

	if (ctx->rx_desc != NULL || ctx->dma_buffer != NULL) {
		return -EINVAL;
	}

	ctx->adc_hal_dma_ctx.rx_desc =
		k_aligned_alloc(sizeof(uint32_t), sizeof(dma_descriptor_t));
	if (ctx->adc_hal_dma_ctx.rx_desc == NULL) {
		return -ENOMEM;
	}

	ctx->rx_desc = ctx->adc_hal_dma_ctx.rx_desc;

	ctx->dma_buffer = NULL;
	ctx->dma_buffer_bytes = 0U;
	ctx->running = false;
	ctx->digi_started = false;
	ctx->eof_fn = NULL;
	ctx->eof_user = NULL;

#if SOC_GDMA_SUPPORTED
	adc_ll_enable_bus_clock(true);
	adc_ll_reset_register();
#elif defined(CONFIG_SOC_SERIES_ESP32)
	ctx->irq_handle = NULL;

	periph_module_enable(PERIPH_I2S0_MODULE);

	{
		i2s_dev_t *i2s_dev = I2S_LL_GET_HW(MOTOR_ADC_DMA_I2S_HOST);

		i2s_ll_enable_core_clock(i2s_dev, true);
	}

	err = esp_intr_alloc(I2S0_INTR_SOURCE, ESP_INTR_FLAG_IRAM | ESP_INTR_FLAG_INTRDISABLED,
			     motor_enc_adc_legacy_dma_isr, ctx, &ctx->irq_handle);
	if (err != 0) {
		k_free(ctx->adc_hal_dma_ctx.rx_desc);
		ctx->adc_hal_dma_ctx.rx_desc = NULL;
		ctx->rx_desc = NULL;
		return err;
	}
#elif defined(CONFIG_SOC_SERIES_ESP32S2)
	ctx->irq_handle = NULL;

	spi_ll_enable_bus_clock(MOTOR_ADC_DMA_SPI_HOST, true);
	spi_ll_reset_register(MOTOR_ADC_DMA_SPI_HOST);

	periph_module_enable(PERIPH_SPI2_DMA_MODULE);
	periph_module_enable(PERIPH_SPI3_DMA_MODULE);

	{
		spi_dev_t *spi_dev = SPI_LL_GET_HW(MOTOR_ADC_DMA_SPI_HOST);

		spi_dma_ll_rx_enable_burst_desc(spi_dev, 0, true);
	}

	err = esp_intr_alloc(SPI3_DMA_INTR_SOURCE,
			     ESP_INTR_FLAG_IRAM | ESP_INTR_FLAG_INTRDISABLED,
			     motor_enc_adc_legacy_dma_isr, ctx, &ctx->irq_handle);
	if (err != 0) {
		k_free(ctx->adc_hal_dma_ctx.rx_desc);
		ctx->adc_hal_dma_ctx.rx_desc = NULL;
		ctx->rx_desc = NULL;
		return err;
	}
#endif

	return 0;
}

static int motor_enc_adc_digi_start(struct motor_enc_adc_digi_ctx *ctx, uint8_t channel_id,
				    adc_atten_t atten, uint8_t resolution_bits, uint32_t sample_freq_hz,
				    uint32_t block_samples, motor_enc_adc_eof_fn eof_fn, void *eof_user)
{
	adc_digi_pattern_config_t pattern[1];
	adc_hal_digi_ctrlr_cfg_t dig_cfg = {0};
	uint32_t unit_atten = UNIT_ATTEN_UNINIT;
	soc_module_clk_t clk_src = ADC_DIGI_CLK_SRC_DEFAULT;
	uint32_t clk_src_freq_hz = 0;
	int err;

	if (block_samples == 0U || eof_fn == NULL) {
		return -EINVAL;
	}

	if (!SOC_ADC_DIG_SUPPORTED_UNIT(ctx->unit)) {
		return -EINVAL;
	}

	ctx->dma_buffer_bytes = block_samples * SOC_ADC_DIGI_DATA_BYTES_PER_CONV;

	if (ctx->dma_buffer != NULL) {
		k_free(ctx->dma_buffer);
		ctx->dma_buffer = NULL;
	}

	ctx->dma_buffer = k_aligned_alloc(sizeof(uint32_t), ctx->dma_buffer_bytes);
	if (ctx->dma_buffer == NULL) {
		return -ENOMEM;
	}

	err = clock_control_on(ctx->clock_dev, ctx->clock_subsys);
	if (err < 0) {
		k_free(ctx->dma_buffer);
		ctx->dma_buffer = NULL;
		return err;
	}

	motor_enc_adc_hw_calibration(ctx->unit);

