FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_sensor/motor_sensor_esp32.c
	ctx->block_samples = block_samples;
	ctx->eof_fn = eof_fn;
	ctx->eof_user = eof_user;

	pattern[0].atten = atten;
	pattern[0].channel = channel_id;
	pattern[0].unit = (uint8_t)ctx->unit;
	pattern[0].bit_width = resolution_bits;

	err = esp_clk_tree_src_get_freq_hz(clk_src, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
					   &clk_src_freq_hz);
	if (err != ESP_OK) {
		k_free(ctx->dma_buffer);
		ctx->dma_buffer = NULL;
		return -EIO;
	}

	dig_cfg.conv_mode = (ctx->unit == ADC_UNIT_1) ? ADC_CONV_SINGLE_UNIT_1
						       : ADC_CONV_SINGLE_UNIT_2;
	dig_cfg.clk_src = clk_src;
	dig_cfg.clk_src_freq_hz = clk_src_freq_hz;
	dig_cfg.sample_freq_hz = sample_freq_hz;
	dig_cfg.adc_pattern = pattern;
	dig_cfg.adc_pattern_len = 1;

	unit_atten = (uint32_t)atten;

#if SOC_GDMA_SUPPORTED
	memset(&ctx->dma_cfg, 0, sizeof(ctx->dma_cfg));
	memset(&ctx->dma_blk, 0, sizeof(ctx->dma_blk));

	ctx->dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
	ctx->dma_cfg.dma_callback = motor_enc_adc_dma_eof_cb;
	ctx->dma_cfg.user_data = ctx;
	ctx->dma_cfg.dma_slot = ESP_GDMA_TRIG_PERIPH_ADC0;
	ctx->dma_cfg.block_count = 1;
	ctx->dma_cfg.head_block = &ctx->dma_blk;
	ctx->dma_blk.block_size = ctx->dma_buffer_bytes;
	ctx->dma_blk.dest_address = (uint32_t)ctx->dma_buffer;
#else
	err = esp_intr_enable(ctx->irq_handle);
	if (err != 0) {
		k_free(ctx->dma_buffer);
		ctx->dma_buffer = NULL;
		return err;
	}
#endif

	err = motor_enc_adc_digi_hw_start(ctx, &dig_cfg, unit_atten, block_samples);
	if (err != 0) {
#if !SOC_GDMA_SUPPORTED
		(void)esp_intr_disable(ctx->irq_handle);
#endif
		k_free(ctx->dma_buffer);
		ctx->dma_buffer = NULL;
		return err;
	}

	ctx->running = true;
	return 0;
}

static void motor_enc_adc_digi_stop(struct motor_enc_adc_digi_ctx *ctx)
{
	if (!ctx->running) {
		return;
	}

	motor_enc_adc_digi_hw_halt(ctx);

	if (ctx->dma_buffer != NULL) {
		k_free(ctx->dma_buffer);
		ctx->dma_buffer = NULL;
	}

	ctx->eof_fn = NULL;
	ctx->eof_user = NULL;
	ctx->running = false;
}

struct motor_sensor_esp32_config {
	mcpwm_dev_t *mcpwm_sync;
	uint8_t sync_timer_id;
	bool sync_is_tep;
	const struct device *sync_actuator;
	const struct device *feedback_sensor;
	adc_unit_t adc_unit;
	uint8_t adc_channel;
	adc_atten_t adc_atten;
	uint8_t adc_resolution_bits;
	uint32_t adc_vref_mv;
	uint32_t adc_sample_freq_hz;
	uint32_t digi_block_samples;
	const struct device *adc_clock_dev;
	clock_control_subsys_t adc_clock_subsys;
	const struct device *dma_dev;
	uint8_t dma_channel;
	float amps_per_volt;
};

struct motor_sensor_esp32_data {
	struct motor_enc_adc_digi_ctx digi;
	float current_amps[1];
	float current_offset[1];
	/* Cached at init: (vref_v / counts) * amps_per_volt. Hot path uses
	 * this as the single scale factor.
	 */
	float amps_per_count;
	uint16_t raw_latched;
	float angle_rad;
	intr_handle_t mcpwm_intr_handle;
	motor_sensor_measurement_done_cb_t measurement_done_cb;
	void *measurement_done_user_data;
};

static int motor_sensor_esp32_check_eof_pwm_grid(const struct motor_sensor_esp32_config *cfg)
{
	const struct motor_stage_config *stage = motor_actuator_get_config(cfg->sync_actuator);
	uint64_t pwm_ns;
	uint64_t eof_ns;

	if (stage == NULL) {
		return -EINVAL;
	}

	pwm_ns = stage->pwm_period_ns;
	if (pwm_ns == 0U) {
		return -EINVAL;
	}

	if ((NSEC_PER_SEC % pwm_ns) != 0ULL) {
		return -EINVAL;
	}

	if (cfg->adc_sample_freq_hz == 0U) {
		return -EINVAL;
	}

	eof_ns = (uint64_t)cfg->digi_block_samples * (uint64_t)NSEC_PER_SEC /
		 (uint64_t)cfg->adc_sample_freq_hz;

	if (eof_ns < pwm_ns) {
		return -EINVAL;
	}

	if ((eof_ns % pwm_ns) != 0ULL) {
		return -EINVAL;
	}

	return 0;
}

static adc_atten_t adc_atten_from_db(int db)
{
	switch (db) {
	case 0:
		return ADC_ATTEN_DB_0;
	case 2:
		return ADC_ATTEN_DB_2_5;
	case 6:
		return ADC_ATTEN_DB_6;
	case 11:
	default:
		return ADC_ATTEN_DB_12;
	}
}

static void IRAM_ATTR mcpwm_sync_isr(void *arg)
{
	const struct device *dev = arg;
	const struct motor_sensor_esp32_config *cfg = dev->config;
	mcpwm_dev_t *mcpwm = cfg->mcpwm_sync;
	uint32_t st = mcpwm_ll_intr_get_status(mcpwm);
	uint32_t ev = cfg->sync_is_tep ? MCPWM_LL_EVENT_TIMER_FULL(cfg->sync_timer_id)
				       : MCPWM_LL_EVENT_TIMER_EMPTY(cfg->sync_timer_id);

	if ((st & ev) != 0U) {
		mcpwm_ll_intr_clear_status(mcpwm, st & ev);
	}
}

static void latch_raw_to_current(const struct motor_sensor_esp32_config *cfg,
				 struct motor_sensor_esp32_data *data, uint16_t raw)
{
	ARG_UNUSED(cfg);

	data->current_amps[0] = (float)raw * data->amps_per_count - data->current_offset[0];
}

static void motor_enc_digi_eof(void *user, const uint8_t *buf, uint32_t n_bytes)
{
	const struct device *dev = user;
	const struct motor_sensor_esp32_config *cfg = dev->config;
	const adc_digi_output_data_t *d = (const adc_digi_output_data_t *)buf;
	struct motor_sensor_esp32_data *data = dev->data;
	uint32_t ns;

	if (n_bytes < SOC_ADC_DIGI_DATA_BYTES_PER_CONV) {
		return;
	}

	ns = n_bytes / SOC_ADC_DIGI_DATA_BYTES_PER_CONV;
#if SOC_GDMA_SUPPORTED
	data->raw_latched = (uint16_t)d[ns - 1U].type2.data;
#else
	data->raw_latched = (uint16_t)d[ns - 1U].type1.data;
#endif
	latch_raw_to_current(cfg, data, data->raw_latched);
	if (data->measurement_done_cb != NULL) {
		data->measurement_done_cb(dev, data->measurement_done_user_data);
	}
}

static void motor_sensor_esp32_data_default_init(struct motor_sensor_esp32_data *data)
{
	data->current_amps[0] = 0.0f;
	data->current_offset[0] = 0.0f;
	data->amps_per_count = 0.0f;
	data->raw_latched = 0U;
	data->angle_rad = 0.0f;
	data->measurement_done_cb = NULL;
	data->measurement_done_user_data = NULL;
}

static int motor_sensor_esp32_start_sample(const struct device *dev, enum motor_sensor_channel ch)
{
	const struct motor_sensor_esp32_config *cfg = dev->config;
	struct motor_sensor_esp32_data *data = dev->data;

	switch (ch) {
	case MOTOR_SENSOR_CHAN_CURRENT:
		ARG_UNUSED(data);
		return 0;
	case MOTOR_SENSOR_CHAN_ANGLE:
#if !IS_ENABLED(CONFIG_SENSOR)
		return -ENOTSUP;
#else
		if (cfg->feedback_sensor == NULL) {
			return -ENOTSUP;
		}
		if (k_is_in_isr()) {
			return MOTOR_SENSOR_ERR_CONTEXT;
		}
		{
			int err = sensor_sample_fetch(cfg->feedback_sensor);

			if (err != 0) {
				return err;
			}
			{
				struct sensor_value val;

				err = sensor_channel_get(cfg->feedback_sensor, SENSOR_CHAN_ROTATION, &val);
				if (err != 0) {
					return err;
				}
				data->angle_rad = (float)sensor_value_to_double(&val);
			}
		}
		return 0;
#endif
	default:
		return -EINVAL;
	}
}

