FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_sensor/motor_sensor_esp32.c
static int motor_sensor_esp32_get_sample(const struct device *dev, enum motor_sensor_channel ch,
					   float *out, size_t out_len, size_t *got)
{
	const struct motor_sensor_esp32_config *cfg = dev->config;
	struct motor_sensor_esp32_data *data = dev->data;

	switch (ch) {
	case MOTOR_SENSOR_CHAN_CURRENT:
		if (out_len < 1U) {
			return -EINVAL;
		}
		out[0] = data->current_amps[0];
		*got = 1U;
		return 0;
	case MOTOR_SENSOR_CHAN_ANGLE:
#if !IS_ENABLED(CONFIG_SENSOR)
		return -ENOTSUP;
#else
		if (cfg->feedback_sensor == NULL) {
			return -ENOTSUP;
		}
		if (out_len < 1U) {
			return -EINVAL;
		}
		out[0] = data->angle_rad;
		*got = 1U;
		return 0;
#endif
	default:
		return -EINVAL;
	}
}

static int motor_sensor_esp32_calibrate(const struct device *dev, enum motor_sensor_channel ch)
{
	ARG_UNUSED(dev);

	if (ch != MOTOR_SENSOR_CHAN_CURRENT) {
		return -ENOTSUP;
	}
	return 0;
}

static int motor_sensor_esp32_set_measurement_done_cb(const struct device *dev,
							motor_sensor_measurement_done_cb_t cb,
							void *user_data)
{
	struct motor_sensor_esp32_data *data = dev->data;

	data->measurement_done_cb = cb;
	data->measurement_done_user_data = user_data;
	return 0;
}

static bool motor_sensor_esp32_channel_supported(const struct device *dev,
						   enum motor_sensor_channel ch)
{
	const struct motor_sensor_esp32_config *cfg = dev->config;

	switch (ch) {
	case MOTOR_SENSOR_CHAN_CURRENT:
		return true;
	case MOTOR_SENSOR_CHAN_ANGLE:
#if !IS_ENABLED(CONFIG_SENSOR)
		return false;
#else
		return cfg->feedback_sensor != NULL;
#endif
	default:
		return false;
	}
}

static const struct motor_sensor_ops motor_sensor_esp32_api = {
	.start_sample = motor_sensor_esp32_start_sample,
	.get_sample = motor_sensor_esp32_get_sample,
	.calibrate = motor_sensor_esp32_calibrate,
	.channel_supported = motor_sensor_esp32_channel_supported,
	.set_measurement_done_callback = motor_sensor_esp32_set_measurement_done_cb,
};

#if SOC_GDMA_SUPPORTED
static int motor_sensor_esp32_dma_dev_check(const struct motor_sensor_esp32_config *cfg)
{
	if (!device_is_ready(cfg->dma_dev)) {
		return -ENODEV;
	}

	return 0;
}
#else
static int motor_sensor_esp32_dma_dev_check(const struct motor_sensor_esp32_config *cfg)
{
	ARG_UNUSED(cfg);
	return 0;
}
#endif

#define ADC_NODE(id) DT_INST_PHANDLE(id, adc)

#if SOC_GDMA_SUPPORTED
#define MOTOR_ESP32_INST_ASSERT_DMA(inst)                                                          \
	BUILD_ASSERT(DT_NODE_HAS_PROP(ADC_NODE(inst), dmas),                                        \
		     "motor_sensor_esp32: adc needs dmas on GDMA SoCs");
#else
#define MOTOR_ESP32_INST_ASSERT_DMA(inst)
#endif

#define SENSOR_ENC_IRQ_FLAGS_PRIO(inst)                                                          \
	(ESP_PRIO_TO_FLAGS(DT_INST_PROP(inst, zephyr_mcpwm_sync_irq_priority)) | ESP_INTR_FLAG_IRAM)

#define SENSOR_ENC_IRQ_FLAGS_DEFAULT(inst)                                                       \
	(ESP_PRIO_TO_FLAGS(DT_IRQ_BY_IDX(DT_INST_PHANDLE(inst, mcpwm_sync), 0, priority)) |        \
	 ESP_INT_FLAGS_CHECK(DT_IRQ_BY_IDX(DT_INST_PHANDLE(inst, mcpwm_sync), 0, flags)) |         \
	 ESP_INTR_FLAG_IRAM)

#define SENSOR_ESP32_DEFINE(inst)                                                                  \
	BUILD_ASSERT(DT_INST_PROP_LEN(inst, adc_channels) == 1, "motor_sensor_esp32: one adc-channels entry"); \
	MOTOR_ESP32_INST_ASSERT_DMA(inst)                                                          \
	static const struct motor_sensor_esp32_config sensor_esp32_cfg_##inst = {               \
		.mcpwm_sync = (mcpwm_dev_t *)DT_REG_ADDR(DT_INST_PHANDLE(inst, mcpwm_sync)),          \
		.sync_timer_id = (uint8_t)DT_INST_PROP(inst, sync_timer_id),                         \
		.sync_is_tep = (strcmp(DT_INST_PROP(inst, sync_edge), "tep") == 0),                  \
		.sync_actuator = DEVICE_DT_GET(DT_INST_PHANDLE(inst, sync_actuator)),               \
		.feedback_sensor =                                                                   \
			COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, feedback_sensor),                    \
				    (DEVICE_DT_GET(DT_INST_PHANDLE(inst, feedback_sensor))),         \
				    (NULL)),                                                         \
		.adc_unit = (adc_unit_t)(DT_PROP(ADC_NODE(inst), unit) - 1),                          \
		.adc_channel = (uint8_t)DT_INST_PROP_BY_IDX(inst, adc_channels, 0),                  \
		.adc_atten = adc_atten_from_db(DT_INST_PROP(inst, adc_channel_attenuation_db)),     \
		.adc_resolution_bits = (uint8_t)DT_INST_PROP(inst, adc_resolution_bits),             \
		.adc_vref_mv = (uint32_t)DT_INST_PROP(inst, adc_vref_mv),                            \
		.adc_sample_freq_hz = (uint32_t)DT_INST_PROP(inst, adc_digi_sample_freq_hz),          \
		.digi_block_samples = (uint32_t)DT_INST_PROP(inst, digi_block_samples),              \
		.adc_clock_dev = DEVICE_DT_GET(DT_CLOCKS_CTLR(ADC_NODE(inst))),                       \
		.adc_clock_subsys =                                                                    \
			(clock_control_subsys_t)DT_CLOCKS_CELL(ADC_NODE(inst), offset),               \
		.dma_dev = COND_CODE_1(DT_NODE_HAS_PROP(ADC_NODE(inst), dmas),                       \
				       (DEVICE_DT_GET(DT_DMAS_CTLR_BY_IDX(ADC_NODE(inst), 0))),       \
				       (NULL)),                                                        \
		.dma_channel = COND_CODE_1(DT_NODE_HAS_PROP(ADC_NODE(inst), dmas),                   \
					 (DT_DMAS_CELL_BY_IDX(ADC_NODE(inst), 0, channel)), (0)),    \
		.amps_per_volt =                                                                     \
			(float)DT_INST_PROP_OR(inst, amps_per_volt_milli, 1000) / 1000.0f,           \
	};                                                                                         \
	static struct motor_sensor_esp32_data sensor_esp32_data_##inst;                            \
	static int motor_sensor_esp32_dev_init_##inst(const struct device *dev)                    \
	{                                                                                            \
		const struct motor_sensor_esp32_config *cfg = dev->config;                           \
		struct motor_sensor_esp32_data *data = dev->data;                                    \
		struct motor_enc_adc_digi_ctx *digi = &data->digi;                                   \
		uint32_t ev;                                                                           \
		int err;                                                                               \
		int irq_flags;                                                                         \
		motor_sensor_esp32_data_default_init(data);                                          \
		data->amps_per_count = (((float)cfg->adc_vref_mv * 1e-3f) /                            \
					 (float)(1U << cfg->adc_resolution_bits)) *                    \
				       cfg->amps_per_volt;                                              \
		if (!device_is_ready(cfg->sync_actuator)) {                                            \
			return -ENODEV;                                                                \
		}                                                                                      \
		if ((cfg->feedback_sensor != NULL) && !device_is_ready(cfg->feedback_sensor)) {       \
			return -ENODEV;                                                                \
		}                                                                                      \
		err = motor_sensor_esp32_dma_dev_check(cfg);                                           \
		if (err != 0) {                                                                        \
			return err;                                                                    \
		}                                                                                      \
		if (!device_is_ready(cfg->adc_clock_dev)) {                                            \
			return -ENODEV;                                                                \
		}                                                                                      \
		err = motor_sensor_esp32_check_eof_pwm_grid(cfg);                                      \
		if (err != 0) {                                                                        \
			return err;                                                                    \
		}                                                                                      \
		digi->unit = cfg->adc_unit;                                                            \
		digi->dma_dev = cfg->dma_dev;                                                          \
		digi->dma_channel = cfg->dma_channel;                                                  \
		digi->clock_dev = cfg->adc_clock_dev;                                                  \
		digi->clock_subsys = cfg->adc_clock_subsys;                                            \
		err = motor_enc_adc_digi_init(digi);                                                   \
		if (err != 0) {                                                                        \
			return err;                                                                    \
		}                                                                                      \
		err = motor_enc_adc_digi_start(digi, cfg->adc_channel, cfg->adc_atten,                  \
					       cfg->adc_resolution_bits, cfg->adc_sample_freq_hz,        \
					       cfg->digi_block_samples, motor_enc_digi_eof, (void *)dev); \
		if (err != 0) {                                                                        \
			return err;                                                                    \
		}                                                                                      \
		ev = cfg->sync_is_tep ? MCPWM_LL_EVENT_TIMER_FULL(cfg->sync_timer_id)                  \
				      : MCPWM_LL_EVENT_TIMER_EMPTY(cfg->sync_timer_id);                \
		mcpwm_ll_intr_clear_status(cfg->mcpwm_sync, ev);                                       \
		mcpwm_ll_intr_enable(cfg->mcpwm_sync, ev, true);                                       \
		irq_flags = COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, zephyr_mcpwm_sync_irq_priority), \
					(SENSOR_ENC_IRQ_FLAGS_PRIO(inst)),                           \
					(SENSOR_ENC_IRQ_FLAGS_DEFAULT(inst)));                       \
		err = esp_intr_alloc(DT_IRQ_BY_IDX(DT_INST_PHANDLE(inst, mcpwm_sync), 0, irq),         \
				     irq_flags, mcpwm_sync_isr, (void *)dev, &data->mcpwm_intr_handle);   \
		if (err != ESP_OK) {                                                                   \
			motor_enc_adc_digi_stop(digi);                                                 \
			return -EIO;                                                                   \
		}                                                                                      \
		return 0;                                                                              \
	}                                                                                            \
	DEVICE_DT_DEFINE(DT_DRV_INST(inst), motor_sensor_esp32_dev_init_##inst, NULL,              \
			 &sensor_esp32_data_##inst, &sensor_esp32_cfg_##inst, POST_KERNEL,            \
			 CONFIG_MOTOR_SENSOR_ESP32_INIT_PRIORITY, &motor_sensor_esp32_api)

DT_INST_FOREACH_STATUS_OKAY(SENSOR_ESP32_DEFINE)
